#小專題：三餐選擇器
#契機：因為每天都要花時間思考三餐要吃什麼，這種行為嚴重降低了效率與效能，所以設計了這個三餐選擇器來為我這個本部人解決三餐問題
#提示：如果當日店家沒有營業，則再重新執行檔案
import random
print("好迷惘喔喔喔喔喔喔喔喔喔喔喔喔喔～早餐要吃什麼午餐要吃什麼晚餐要吃什麼拉拉拉～～")
while True:
    breakfast=random.choice(["男子漢早餐店","新永泉早餐店","福來早餐","麥當勞","便利商店","活力飯糰","永和豆漿大王","外帶饅頭、麵包","亞米早餐","師大美而美","漢堡王"])
    lunch=random.choice(["男子漢早餐店","新永泉早餐店","福來早餐","麥當勞","便利商店","活力飯糰","亞米早餐","蛋幾勒","燈籠滷味(大)","燈籠滷味(小)","蚩尤鐵板燒","師園鹹酥雞","銅樂小火鍋","糧倉蛋炒飯","涼麵(推車)","鍋燒意麵(推車)","義肥","13 burger","福州麵","泰式酸辣麵","安徽妹子麵餅舖","牛老大","薩莉亞義式餐廳","三商巧福","綜大外便當攤販","學餐(本部)","學餐(男一舍)","師大美而美","膳魚意麵","福勝亭","甘泉魚麵","元日本豚骨拉麵","subway","八方雲集","街口皇廚","START CURRY","木町","雲鼎阿二麻辣食堂","咖哩戰線","生魚飯(師大夜市內)","生魚飯(靠近)","漢堡王","馬來西亞料理","楓月女僕咖啡廳"])
    dinner=random.choice(["蛋幾勒","燈籠滷味(大)","燈籠滷味(小)","蚩尤鐵板燒","師園鹹酥雞","銅樂小火鍋","糧倉蛋炒飯","鍋燒意麵(推車)","義肥","13 burger","福州麵","泰式酸辣麵","安徽妹子麵餅舖","牛老大","薩莉亞義式餐廳","三商巧福","學餐(本部)","學餐(男一舍)","師大美而美","膳魚意麵","福勝亭","甘泉魚麵","元日本豚骨拉麵","subway","八方雲集","街口皇廚","START CURRY","木町","雲鼎阿二麻辣食堂","咖哩戰線","日式烏龍麵(咖哩戰線旁邊)","生魚飯(師大夜市內)","生魚飯(靠近)","漢堡王","米粉湯","生炒花枝羹","師大生煎包","馬來西亞料理","牛魔王(巷子內)","蔥油餅(推車)","牛魔王(男一舍後面)","大台北滷味","沙威瑪","軒軒滷味","騎士雞排","楓月旅樸咖啡廳"])
    if breakfast == lunch == dinner:
        continue
    else:
        break
print("\n\n今天早餐就吃："+breakfast)
print("今天午餐就吃："+lunch)
print("今天晚餐就吃："+dinner)
print("\n\n\n耶耶耶！自從有了三餐選擇器，我就不再為三餐迷惘了！")

